{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "69355d3cc810f874"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW3i32o", 
        "data_layout": "NCHW3c", 
        "hash": "fd5ff17ee689d21e"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW32c", 
        "hash": "d75436e5d7587373"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "d675f67ef0839b61"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW64i32o", 
        "data_layout": "NCHW64c", 
        "hash": "83e0f5d1673ff2ae"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "b93ed533ccb758d2"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW64i32o", 
        "data_layout": "NCHW64c", 
        "hash": "4d5264dc543c91a8"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_add_nn_relu_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_add_nn_relu_layout_transform", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "a1ffa55a1c5c34fd"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW64i32o", 
        "data_layout": "NCHW64c", 
        "hash": "83e0f5d1673ff2ae"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "b93ed533ccb758d2"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW64i32o", 
        "data_layout": "NCHW64c", 
        "hash": "3d4ef73e1332a711"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "out_layout": "NCHW64c", 
        "kernel_layout": "OIHW32i64o", 
        "data_layout": "NCHW32c", 
        "hash": "2c45490f14a7ca9a"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW64c", 
        "dst_layout": "NCHW128c", 
        "hash": "3744ca7f040bd8b3"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW8c", 
        "hash": "37c1387e7e7af316"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW8i32o", 
        "data_layout": "NCHW8c", 
        "hash": "5662315346a7365c"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW128i32o", 
        "data_layout": "NCHW128c", 
        "hash": "107256fb6742645a"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_1", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "3a74e2d111d92c1a"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW128i32o", 
        "data_layout": "NCHW128c", 
        "hash": "60d935c984b3b19a"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "dcb565bebcb860f4"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW128i32o", 
        "data_layout": "NCHW128c", 
        "hash": "03f0e99b0296c379"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW8c", 
        "hash": "b8cbb72b4035894d"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW8i32o", 
        "data_layout": "NCHW8c", 
        "hash": "e7b5afa076a0f303"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "0f0f0432149099df"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_6", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "ed48b9142e4b736f"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_1", 
        "out_layout": "NCHW16c", 
        "kernel_layout": "OIHW64i16o", 
        "data_layout": "NCHW64c", 
        "hash": "c0ec5cd9ca121caa"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "out_layout": "NCHW16c", 
        "kernel_layout": "OIHW128i16o", 
        "data_layout": "NCHW128c", 
        "hash": "a4d3ad431e89368c"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_2", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "8c9750969cf89d45"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
        "out_layout": "NCHW16c", 
        "kernel_layout": "OIHW128i16o", 
        "data_layout": "NCHW128c", 
        "hash": "8cf1297a388fbc37"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "14420dc564d7559a"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "out_layout": "NCHW16c", 
        "kernel_layout": "OIHW128i16o", 
        "data_layout": "NCHW128c", 
        "hash": "a510498d78c9beff"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW8c", 
        "hash": "a9751ae8f8612266"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW8i32o", 
        "data_layout": "NCHW8c", 
        "hash": "3ade51e0c6ea8f9b"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_9", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "092277d9fff75bcf"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_71", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "14420dc564d7559a"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_2", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW128i32o", 
        "data_layout": "NCHW128c", 
        "hash": "e8734f3d315f8894"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_3", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW512i32o", 
        "data_layout": "NCHW512c", 
        "hash": "32425e677e52262b"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_layout_transform_3", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "039eb5f95ef9e967"
      }, 
      "inputs": [
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW512i32o", 
        "data_layout": "NCHW512c", 
        "hash": "fa27baff2951f2ee"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_91", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_9", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "092277d9fff75bcf"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_multiply_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "kernel_layout": "OIHW512i32o", 
        "data_layout": "NCHW512c", 
        "hash": "02414d6a041943a2"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW32c", 
        "hash": "25d14be001c2a4c3"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_nn_batch_flatten_nn_batch_flatten", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_nn_batch_flatten_nn_batch_flatten", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW", 
        "hash": "d91f53ab75e6a58f"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
        "weight_layout": "NC25n", 
        "hash": "3a58486faea1da6e"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    7, 
    9, 
    10, 
    13, 
    15, 
    16, 
    18, 
    19, 
    22, 
    23, 
    25, 
    26, 
    29, 
    31, 
    34, 
    36, 
    37, 
    40, 
    41, 
    44, 
    45, 
    48, 
    50, 
    53, 
    55, 
    56, 
    59, 
    60, 
    63, 
    64, 
    67, 
    69, 
    72, 
    74, 
    75, 
    78, 
    79, 
    80, 
    84, 
    85
  ], 
  "heads": [
    [
      86, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        2, 
        6, 
        5, 
        7, 
        8, 
        9, 
        5, 
        10, 
        9, 
        11, 
        12, 
        2, 
        13, 
        14, 
        5, 
        2, 
        15, 
        16, 
        5, 
        17, 
        18, 
        2, 
        9, 
        19, 
        2, 
        20, 
        5, 
        2, 
        21, 
        9, 
        22, 
        23, 
        5, 
        9, 
        24, 
        25, 
        5, 
        9, 
        26, 
        27, 
        2, 
        9, 
        28, 
        2, 
        29, 
        5, 
        2, 
        30, 
        9, 
        31, 
        32, 
        5, 
        9, 
        33, 
        34, 
        5, 
        9, 
        35, 
        36, 
        2, 
        9, 
        37, 
        2, 
        38, 
        39, 
        2, 
        40, 
        39, 
        41, 
        42, 
        9, 
        39, 
        43, 
        44, 
        45, 
        9, 
        46, 
        47, 
        48, 
        49, 
        46
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [3, 1, 1], 
        [1, 1, 224, 224, 3], 
        [2, 1, 7, 7, 3, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 112, 112, 32], 
        [1, 2, 56, 56, 32], 
        [1, 2, 1, 1, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 56, 56, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 1, 1, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [2, 2, 3, 3, 32, 64], 
        [1, 2, 1, 1, 64], 
        [1, 2, 28, 28, 64], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 8, 56, 56, 8], 
        [4, 8, 1, 1, 8, 32], 
        [1, 4, 28, 28, 32], 
        [1, 4, 28, 28, 32], 
        [1, 4, 1, 1, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 16, 28, 28, 8], 
        [8, 16, 3, 3, 8, 32], 
        [1, 8, 1, 1, 32], 
        [1, 8, 14, 14, 32], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 2, 28, 28, 64], 
        [16, 2, 1, 1, 64, 16], 
        [1, 16, 14, 14, 16], 
        [1, 16, 14, 14, 16], 
        [1, 16, 1, 1, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 32, 14, 14, 8], 
        [16, 32, 3, 3, 8, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 2, 14, 14, 128], 
        [16, 2, 1, 1, 128, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 1, 1, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 1, 1, 32], 
        [1, 512], 
        [40, 512, 25], 
        [1, 1000], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87
  ]
}